In [1]:
%load_ext sql
%reload_ext sql
%sql sqlite://

In [2]:
%%sql
CREATE TABLE Worker (
WORKER_ID INT,
FIRST_NAME CHAR(25),
LAST_NAME CHAR(25),
SALARY INT(15),
JOINING_DATE DATETIME,
DEPARTMENT CHAR(25)
);

 * sqlite://
Done.

[]

In [3]:
%%sql
INSERT INTO Worker VALUES(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR');
INSERT INTO Worker VALUES(2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin');
INSERT INTO Worker VALUES(3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR');
INSERT INTO Worker VALUES(4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin');
INSERT INTO Worker VALUES(5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin');
INSERT INTO Worker VALUES(6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account');
INSERT INTO Worker VALUES(7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account');
INSERT INTO Worker VALUES(8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin');
INSERT INTO Worker VALUES(9, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account');
INSERT INTO Worker VALUES(10, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin');
INSERT INTO Worker VALUES(11, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

#### Q-17. Write an SQL query to show the top n (say 10) records of a table.

In [8]:
%%sql
select * from worker limit 10

 * sqlite://
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
 (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin'),
 (9, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (10, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin')]

#### Q-18. Write an SQL query to determine the nth (say n=5) highest salary from a table.

In [15]:
%%sql
select distinct(salary) from Worker Desc LIMIT  5

 * sqlite://
Done.

[(100000,), (80000,), (300000,), (500000,), (200000,)]